I have gone back over my logs and I think I have found the problem. It _may_ have been (was absolutely) a PEBKAC.

<details>
  <summary>All the logs</summary>

### run 17
On run [#17](https://github.com/evoteum/estate-repos/actions/runs/13317301569/job/37194351760) where I had fixed most of my bugs, but was still getting state not found;

- [repo at the time
](https://github.com/evoteum/estate-repos/tree/0ff6f6fd9d71c4945dfccf0ab117fb1e0e6dbe2a/tofu)
- tofu plan:

```sh
OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Planning OpenTofu
╷
│ Error: Invalid function argument
│ 
│   on locals.tofu line 2, in locals:
│    2:   repositories = yamldecode(file("${path.module}/../repositories.yaml"))
│     ├────────────────
│     │ while calling file(path)
│     │ path.module is "."
│ 
│ Invalid value for "path" parameter: no file exists at
│ "./../repositories.yaml"; this function works only with files that are
│ distributed as part of the configuration source code, so if this file will
│ be created by a resource in this configuration you must instead obtain this
│ result from an attribute of that resource.
╵
Error: OpenTofu exited with code 1.
Showing OpenTofu plan
╷
│ Error: Failed to read the given file as a state or plan file
│ 
│ State read error: Error loading statefile: open tfplan: no such file or
│ directory
│ 
│ Plan read error: couldn't load the provided path as either a local plan
│ file (open tfplan: no such file or directory) or a saved cloud plan (open
│ tfplan: no such file or directory)
╵
Error: Process completed with exit code 1.

```

## Run 19

Got problems with the imports and the same error 

- [repo at the time](https://github.com/evoteum/estate-repos/tree/3d091b956c1a93db910df2312332e092dae0f1df/tofu)

```sh
OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Planning OpenTofu
╷
│ Error: Configuration for import target does not exist
│ 
│   on import.tofu line 1:
│    1: import {
│ 
│ The configuration for the given import
│ module.github_repository.github_repository.github_repository does not
│ exist. All target instances must have an associated configuration to be
│ imported.
╵
╷
│ Error: Configuration for import target does not exist
│ 
│   on import.tofu line 6:
│    6: import {
│ 
│ The configuration for the given import
│ module.github_repository.github_repository.github_repository does not
│ exist. All target instances must have an associated configuration to be
│ imported.
╵
╷
│ Error: Configuration for import target does not exist
│ 
│   on import.tofu line 11:
│   11: import {
│ 
│ The configuration for the given import
│ module.github_repository.github_repository.github_repository does not
│ exist. All target instances must have an associated configuration to be
│ imported.
╵
╷
│ Error: Configuration for import target does not exist
│ 
│   on import.tofu line 16:
│   16: import {
│ 
│ The configuration for the given import
│ module.github_repository.github_repository.github_repository does not
│ exist. All target instances must have an associated configuration to be
│ imported.
╵
Error: OpenTofu exited with code 1.
Showing OpenTofu plan
╷
│ Error: Failed to read the given file as a state or plan file
│ 
│ State read error: Error loading statefile: open tfplan: no such file or
│ directory
│ 
│ Plan read error: couldn't load the provided path as either a local plan
│ file (open tfplan: no such file or directory) or a saved cloud plan (open
│ tfplan: no such file or directory)
╵
Error: Process completed with exit code 1.
```
### run 20
Then I added a null_resource and took the import blocks out, and that error message went away. Back to my own mistakes.

- [repo at the time](https://github.com/evoteum/estate-repos/tree/9afdd516fd86f538ebe86c68bad6852ee26aa940/tofu) 
- [tofu plan](https://github.com/evoteum/estate-repos/actions/runs/13317444910/job/37194826164):

```sh
 rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Planning OpenTofu
null_resource.bootstrap: Refreshing state... [id=2583830053810930434]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # module.github_repository[".github"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + commit_message      = "Initialize README.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            [//]: # (STANDARD README)
            [//]: # (https://github.com/RichardLitt/standard-readme)
            [//]: # (----------------------------------------------)

╷
│ Error: Unsupported attribute
│ 
│   on github.tofu line 7, in module "github_repository":
│    7:   visibility       = each.value.visibility
│     ├────────────────
│     │ each.value is object with 1 attribute "description"
│ 
│ This object does not have an attribute named "visibility".
╵
╷
│ Error: Unsupported attribute
│ 
│   on github.tofu line 7, in module "github_repository":
│    7:   visibility       = each.value.visibility
│     ├────────────────
│     │ each.value is object with 1 attribute "description"
│ 
│ This object does not have an attribute named "visibility".
╵
╷
│ Error: Unsupported attribute
│ 
│   on github.tofu line 7, in module "github_repository":
│    7:   visibility       = each.value.visibility
│     ├────────────────
│     │ each.value is object with 1 attribute "description"
│ 
│ This object does not have an attribute named "visibility".
╵
╷
│ Error: Unsupported attribute
│ 
│   on github.tofu line 7, in module "github_repository":
│    7:   visibility       = each.value.visibility
│     ├────────────────
│     │ each.value is object with 1 attribute "description"
│ 
│ This object does not have an attribute named "visibility".
╵
╷
│ Error: Unsupported attribute
│ 
│   on github.tofu line 7, in module "github_repository":
│    7:   visibility       = each.value.visibility
│     ├────────────────
│     │ each.value is object with 1 attribute "description"
│ 
│ This object does not have an attribute named "visibility".
╵
╷
│ Error: Unsupported attribute
│ 
│   on github.tofu line 7, in module "github_repository":
│    7:   visibility       = each.value.visibility
│     ├────────────────
│     │ each.value is object with 1 attribute "description"
│ 
│ This object does not have an attribute named "visibility".
╵
╷
│ Error: Unsupported attribute
│ 
│   on github.tofu line 7, in module "github_repository":
│    7:   visibility       = each.value.visibility
│     ├────────────────
│     │ each.value is object with 1 attribute "description"
│ 
│ This object does not have an attribute named "visibility".
╵
╷
│ Error: Invalid function argument
│ 
│   on .terraform/modules/github_repository/github/repo/variables.tofu line 138, in variable "topics":
│  138:     condition     = length(var.topics) <= 20
│     ├────────────────
│     │ while calling length(value)
│     │ var.topics is null
│ 
│ Invalid value for "value" parameter: argument must not be null.
╵
╷
│ Error: Invalid function argument
│ 
│   on .terraform/modules/github_repository/github/repo/variables.tofu line 138, in variable "topics":
│  138:     condition     = length(var.topics) <= 20
│     ├────────────────
│     │ while calling length(value)
│     │ var.topics is null
│ 
│ Invalid value for "value" parameter: argument must not be null.
╵
╷
│ Error: Invalid function argument
│ 
│   on .terraform/modules/github_repository/github/repo/variables.tofu line 138, in variable "topics":
│  138:     condition     = length(var.topics) <= 20
│     ├────────────────
│     │ while calling length(value)
│     │ var.topics is null
│ 
│ Invalid value for "value" parameter: argument must not be null.
╵
╷
│ Error: Invalid function argument
│ 
│   on .terraform/modules/github_repository/github/repo/variables.tofu line 138, in variable "topics":
│  138:     condition     = length(var.topics) <= 20
│     ├────────────────
│     │ while calling length(value)
│     │ var.topics is null
│ 
│ Invalid value for "value" parameter: argument must not be null.
╵
╷
│ Error: Invalid function argument
│ 
│   on .terraform/modules/github_repository/github/repo/variables.tofu line 138, in variable "topics":
│  138:     condition     = length(var.topics) <= 20
│     ├────────────────
│     │ while calling length(value)
│     │ var.topics is null
│ 
│ Invalid value for "value" parameter: argument must not be null.
╵
╷
│ Error: Invalid function argument
│ 
│   on .terraform/modules/github_repository/github/repo/variables.tofu line 138, in variable "topics":
│  138:     condition     = length(var.topics) <= 20
│     ├────────────────
│     │ while calling length(value)
│     │ var.topics is null
│ 
│ Invalid value for "value" parameter: argument must not be null.
╵
╷
│ Error: Invalid function argument
│ 
│   on .terraform/modules/github_repository/github/repo/variables.tofu line 138, in variable "topics":
│  138:     condition     = length(var.topics) <= 20
│     ├────────────────
│     │ while calling length(value)
│     │ var.topics is null
│ 
│ Invalid value for "value" parameter: argument must not be null.
╵
    
            
            All our code is licenced under the AGPL-3.0. See [LICENSE](LICENSE) for more information.
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = ".github"
      + sha                 = (known after apply)
    }

  # module.github_repository["estate-config"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + commit_message      = "Initialize README.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            [//]: # (STANDARD README)
            [//]: # (https://github.com/RichardLitt/standard-readme)

            
            All our code is licenced under the AGPL-3.0. See [LICENSE](LICENSE) for more information.
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "estate-config"
      + sha                 = (known after apply)
    }

  # module.github_repository["estate-repos"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + commit_message      = "Initialize README.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            [//]: # (STANDARD README)
            [//]: # (https://github.com/RichardLitt/standard-readme)
     
            All our code is licenced under the AGPL-3.0. See [LICENSE](LICENSE) for more information.
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "estate-repos"
      + sha                 = (known after apply)
    }

  # module.github_repository["estate-reusable-workflows"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + commit_message      = "Initialize README.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            [//]: # (STANDARD README)
            [//]: # (https://github.com/RichardLitt/standard-readme)
   
            ## License
            [//]: # (REQUIRED)
            
            All our code is licenced under the AGPL-3.0. See [LICENSE](LICENSE) for more information.
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "estate-reusable-workflows"
      + sha                 = (known after apply)
    }

  # module.github_repository["evoteum.github.io"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + commit_message      = "Initialize README.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            [//]: # (STANDARD README)
            [//]: # (https://github.com/RichardLitt/standard-readme)
            [//]: # (----------------------------------------------)
            [//]: # (Uncomment optional sections as required)

            [//]: # (REQUIRED)
            
            All our code is licenced under the AGPL-3.0. See [LICENSE](LICENSE) for more information.
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "evoteum.github.io"
      + sha                 = (known after apply)
    }

  # module.github_repository["planzoco"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + commit_message      = "Initialize README.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            [//]: # (STANDARD README)
            [//]: # (https://github.com/RichardLitt/standard-readme)
     
            ## License
            [//]: # (REQUIRED)
            
            All our code is licenced under the AGPL-3.0. See [LICENSE](LICENSE) for more information.
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "planzoco"
      + sha                 = (known after apply)
    }

  # module.github_repository["tofu-modules"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + commit_message      = "Initialize README.md"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            [//]: # (STANDARD README)
            [//]: # (https://github.com/RichardLitt/standard-readme)
            [//]: # (----------------------------------------------)
  
            ## License
            [//]: # (REQUIRED)
            
            All our code is licenced under the AGPL-3.0. See [LICENSE](LICENSE) for more information.
        EOT
      + file                = "README.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "tofu-modules"
      + sha                 = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
::error::OpenTofu exited with code 1.
```
</details>

### the PEBKAC

The error message that prompted this FR appears to have been;

```sh
Error: OpenTofu exited with code 1.
Showing OpenTofu plan
╷
│ Error: Failed to read the given file as a state or plan file
│ 
│ State read error: Error loading statefile: open tfplan: no such file or
│ directory
│ 
│ Plan read error: couldn't load the provided path as either a local plan
│ file (open tfplan: no such file or directory) or a saved cloud plan (open
│ tfplan: no such file or directory)
╵
Error: Process completed with exit code 1.
```

I now see that this is _actually_ referring to the lack of a _plan_ file, owing to the errors preventing `tofu plan` getting to the stage where it can output a plan, and the ` │ State read error: Error loading statefile` is a red herring. The problem was that my [imports](https://github.com/evoteum/estate-repos/blob/3d091b956c1a93db910df2312332e092dae0f1df/tofu/import.tofu) did not fully qualify the repo name with `[owner]/[name]`.

Using [evoteum/testy-mctestface](https://github.com/evoteum/testy-mctestface), I have also confirmed that, if you don't make any mistakes, the state file _does_ get successfully made in S3 as expected. No need for any cajoling whatsoever.

Please accept my apologies.

Thanks for all your help anyway @apparentlymart et al.